bolknote/MK61S_MINI/code/terminal.cpp
#include "terminal.hpp"
#include "Arduino.h"
#include "bounded_string.hpp"
#include "config.h"
#include "device_identity.hpp"
#include "hardware_info.hpp"
#include "rust_types.h"
#include "cross_hal.h"
#include "crc32.hpp"
#include "mk61emu_core.h"
#include "disasm.hpp"
#include "tools.hpp"
#include "calculator_control.hpp"
#include "lcd_ru.hpp"
#include "ledcontrol.h"
#include "mk_math.hpp"
#include "mk8_literal.hpp"
#include "mk61_ref.hpp"
#include "mk61_register_init.hpp"
#include "entropy_pool.hpp"
#include "m61_print.hpp"
#include "m61_ansi.hpp"
#include "m61_text.hpp"
#include "virtual_fat.hpp"
#include "program_store.hpp"
#include "language_workspace.hpp"
#if MK61_ANY_LOADABLE_MODULE
  #include "loadable_module_runtime.hpp"
#endif
#include "shared_scratch.hpp"
#include "shared_memory.hpp"
#include "workspace_swap.hpp"
#include "storage_path.hpp"
#include "spi_nor_flash.hpp"
#if MK61_ENABLE_READ_BENCHMARKS
  #include "read_benchmark.hpp"
#endif
#include "resident_firmware.hpp"
#include "power_monitor.hpp"
#if defined(MK61_OLED1602_WS0010)
  #include "ws0010_charset.hpp"
  #include "ws0010_graphics.hpp"
#endif
#include "terminal_command_ids.hpp"
#include "terminal_core.hpp"
#include "terminal_file_transfer.hpp"
#include "terminal_front_coding.hpp"
#include "terminal_line_editor.hpp"
#include "terminal_output.hpp"
#include "terminal_encoding.hpp"
#include "terminal_protocol.hpp"
#include "usb_screen.hpp"
#include "usb_mass_storage.hpp"
#include "rtc_clock.hpp"
#include "dwt_profiler.hpp"
#include "classic_timer.hpp"
#include "crash_dump.hpp"
#include "independent_watchdog.hpp"
#include "mpu_guard.hpp"
#include "idle_sleep.hpp"
#include "deep_idle.hpp"
#include "usb_cdc_rx_guard.hpp"
#include "usb_power.hpp"
#include "menu.hpp"
#if MK61_ENABLE_SPI1_ARBITER
  #include "spi1_bus.hpp"
#endif
#if MK61_ENABLE_SPI1_DMA
  #include "spi1_dma.hpp"
#endif



extern  const char terminal_symbols[16];
extern  const char display_symbols[16];


#include "terminal_key_sequence.hpp"


const   u8                  CR = 0x0D;
const   u8                  NL = 0x0A;

extern  class_disassm_mk61  disassembler;
extern  void DFU_enable(void);
extern  void idle_signal_reset(void);



#include "terminal_catalog.hpp"
static const char* terminal_skip_spaces(const char* p) {
  while(p != NULL && (*p == ' ' || *p == '\t')) p++;
  return p;
}

static bool terminal_arg_end(const char* p) {
  p = terminal_skip_spaces(p);
  return p == NULL || *p == 0 || *p == '\r' || *p == '\n';
}

static bool terminal_parse_quick_number(const char* args, usize& number_out) {
  args = terminal_skip_spaces(args);
  if(args == NULL || *args < '0' || *args > '9') return false;

  usize number = 0;
  const char* p = args;
  while(*p >= '0' && *p <= '9') {
    number = number * 10 + (usize) (*p - '0');
    if(number > MAX_SLOT_FOR_PROGRAM) return false;
    p++;
  }
  if(!terminal_arg_end(p)) return false;
  number_out = number;
  return true;
}

static bool terminal_copy_arg(char* out, usize capacity, const char* args) {
  args = terminal_skip_spaces(args);
  if(out == NULL || capacity == 0 || args == NULL) return false;
  usize len = 0;
  while(args[len] != 0 && args[len] != '\r' && args[len] != '\n') len++;
  while(len > 0 && (args[len - 1] == ' ' || args[len - 1] == '\t')) len--;
  if(len == 0 || len >= capacity) return false;
  memcpy(out, args, len);
  out[len] = 0;
  return true;
}

static bool terminal_single_token(const char* args, char* out,
                                  usize capacity) {
  const char* cursor = args;
  return terminal_core::parse_token(cursor, out, capacity) &&
         terminal_core::at_end(cursor);
}

static bool terminal_serial_write_byte(u8 byte, void*) {
  return Serial.write(byte) == 1;
}

static void terminal_write_cp1251(const char* text) {
  Serial.print(text);
}

static void terminal_write_m8(const char* text) {
  (void) terminal_encoding::write_m8(
      text, terminal_serial_write_byte, nullptr);
}

static void terminal_write_m8(const u8* text, usize length) {
  (void) terminal_encoding::write_m8(
      text, length, terminal_serial_write_byte, nullptr);
}

static void terminal_println_cp1251(const char* text) {
  terminal_write_cp1251(text);
  Serial.println();
}

static void terminal_println_m8(const char* text) {
  terminal_write_m8(text);
  Serial.println();
}

static void terminal_path_error(const char* operation,
                                storage_path::Status status) {
  Serial.print(operation);
  Serial.print(": ");
  Serial.println(storage_path::status_text(status));
}

static bool terminal_vfat_log(const char* args) {
  if(!terminal_core::at_end(args)) {
    char token[6];
    if(!terminal_single_token(args, token, sizeof(token)) ||
       strcmp(token, "clear") != 0) {
      Serial.println("Usage: vlog [clear]");
      return false;
    }
    virtual_fat::clear_diagnostic();
    usb_mass_storage::clear_startup_diagnostic();
  }
  char line[virtual_fat::DIAGNOSTIC_LINE_SIZE];
  const auto& diagnostic = virtual_fat::diagnostic();
  if(!virtual_fat::format_diagnostic(diagnostic, line, sizeof(line))) return false;
  Serial.println(line);
  const usb_mass_storage::StartupDiagnostic startup =
      usb_mass_storage::startup_diagnostic();
  terminal_output::field(Serial, "MSC startup valid=", startup.valid ? 1 : 0);
  terminal_output::line(Serial, " stage=", startup.valid ? startup.stage : 0);
  return true;
}

static void terminal_print_fs_entry(const program_store::Entry& entry) {
  char name[storage_path::VISIBLE_NAME_SIZE];
  if(!storage_path::visible_name(entry, name, sizeof(name))) {
    Serial.println("?\t<invalid entry>");
    return;
  }
  if(entry.kind == program_store::NodeKind::DIRECTORY) {
    Serial.print("d\t");
    terminal_write_m8(name);
    Serial.println('/');
  } else {
    Serial.print("f\t");
    Serial.print(entry.data_len);
    Serial.print(" B\t");
    terminal_println_m8(name);
  }
}

static void terminal_print_hex_byte(u8 value) {
  Serial.write(terminal_file_transfer::hex_char((u8) (value >> 4)));
  Serial.write(terminal_file_transfer::hex_char((u8) (value & 0x0F)));
}

static void terminal_print_hex_u32(u32 value) {
  terminal_print_hex_byte((u8) (value >> 24));
  terminal_print_hex_byte((u8) (value >> 16));
  terminal_print_hex_byte((u8) (value >> 8));
  terminal_print_hex_byte((u8) value);
}


// Единственная таблица терминала повторяет обозначения советского
// справочника. Русские буквы уже записаны байтами M8/CP1251, а знаки, которых
// нет в CP1251, представлены однозначными ASCII-последовательностями.
static constexpr char ISA_61[] =
"0,1,2,3,4,5,6,7,8,9,.,/-/,\302\317,CX,B^,Bx,+,-,*,:,XY,F10^x,Fe^x,Flg,Fln,Fasin,Facos,Fatg,Fsin,Fcos,Ftg,?,\
\317\xE8,V\"\"\",Fx^2,F1/x,Fx^y,(),Ko->',?,?,?,Ko->'\",?,?,?,?,?,Ko<-'\",|x|,3H,Ko<-',K[x],K{x},Kmax,K^,Kv,K(+),\310HB,C\327,?,Ko->'\",?,?,\
X->\3170,X->\3171,X->\3172,X->\3173,X->\3174,X->\3175,X->\3176,X->\3177,X->\3178,X->\3179,X->\317A,X->\317B,X->\317C,X->\317\304,X->\317E,?,\
C/\317,\301/\317,B/O,\317/\317,HO\317,?,?,Fx!=0,FL2,Fx>=0,FL3,FL1,Fx<0,FL0,Fx=0,?,\
\317->X0,\317->X1,\317->X2,\317->X3,\317->X4,\317->X5,\317->X6,\317->X7,\317->X8,\317->X9,\317->XA,\317->XB,\317->XC,\317->X\xC4,\317->XE,?,\
Kx!=0 0,Kx!=0 1,Kx!=0 2,Kx!=0 3,Kx!=0 4,Kx!=0 5,Kx!=0 6,Kx!=0 7,Kx!=0 8,Kx!=0 9,Kx!=0 A,Kx!=0 B,Kx!=0 C,Kx!=0 \304,Kx!=0 E,?,\
K\301\3170,K\301\3171,K\301\3172,K\301\3173,K\301\3174,K\301\3175,K\301\3176,K\301\3177,K\301\3178,K\301\3179,K\301\317A,K\301\317B,K\301\317C,K\301\317\304,K\301\317E,?,\
Kx>=0 0,Kx>=0 1,Kx>=0 2,Kx>=0 3,Kx>=0 4,Kx>=0 5,Kx>=0 6,Kx>=0 7,Kx>=0 8,Kx>=0 9,Kx>=0 A,Kx>=0 B,Kx>=0 C,Kx>=0 \304,Kx>=0 E,?,\
\312\317\3170,\312\317\3171,\312\317\3172,\312\317\3173,\312\317\3174,\312\317\3175,\312\317\3176,\312\317\3177,\312\317\3178,\312\317\3179,\312\317\317A,\312\317\317B,\312\317\317C,\312\317\317\304,\312\317\317E,?,\
KX->\3170,KX->\3171,KX->\3172,KX->\3173,KX->\3174,KX->\3175,KX->\3176,KX->\3177,KX->\3178,KX->\3179,KX->\317A,KX->\317B,KX->\317C,KX->\317\304,KX->\317E,?,\
Kx<0 0,Kx<0 1,Kx<0 2,Kx<0 3,Kx<0 4,Kx<0 5,Kx<0 6,Kx<0 7,Kx<0 8,Kx<0 9,Kx<0 A,Kx<0 B,Kx<0 C,Kx<0 \304,Kx<0 E,?,\
K\317->X0,K\317->X1,K\317->X2,K\317->X3,K\317->X4,K\317->X5,K\317->X6,K\317->X7,K\317->X8,K\317->X9,K\317->XA,K\317->XB,K\317->XC,K\317->X\304,K\317->XE,?,\
Kx=0 0,Kx=0 1,Kx=0 2,Kx=0 3,Kx=0 4,Kx=0 5,Kx=0 6,Kx=0 7,Kx=0 8,Kx=0 9,Kx=0 A,Kx=0 B,Kx=0 C,Kx=0 \304,Kx=0 E,?";

