bolknote/MK61S_MINI/code/terminal.cpp
template<usize N>
constexpr usize terminal_mnemonic_count(const char (&table)[N]) {
  usize count = 1;
  for(usize index = 0; index + 1 < N; index++) {
    if(table[index] == ',') count++;
  }
  return count;
}

template<usize N>
constexpr usize terminal_mnemonic_max_length(const char (&table)[N]) {
  usize longest = 0;
  usize current = 0;
  for(usize index = 0; index < N; index++) {
    if(table[index] == ',' || table[index] == 0) {
      if(current > longest) longest = current;
      current = 0;
    } else {
      current++;
    }
  }
  return longest;
}

constexpr bool terminal_mnemonic_equals(const char* table, usize opcode,
                                        const char* expected) {
  while(opcode != 0) {
    if(*table == 0) return false;
    if(*table++ == ',') opcode--;
  }
  while(*expected != 0 && *table == *expected) {
    table++;
    expected++;
  }
  return *expected == 0 && (*table == ',' || *table == 0);
}

static_assert(terminal_mnemonic_count(ISA_61) == terminal_keys::COUNT,
              "mnemonic table must cover opcodes 00..EF");
static_assert(terminal_mnemonic_max_length(ISA_61) <= 8,
              "increase MAX_LEN_CLASSIC_MNEMO");
static_assert(terminal_mnemonic_equals(
                  ISA_61, 0xD9, "K\317->X9"),
              "opcode D9 must retain the P9 register mnemonic");

#if MK61_F401_PRODUCT_BUILD
// Consecutive mnemonic families share long prefixes (sto[0]..sto[E],
// Kx>=0 0..E, ...). Store only the common-prefix length plus each suffix in
// product F401 images. The canonical CSV strings above remain the single
// editable source and are consumed entirely at compile time.
static_assert(terminal_front_coding::source_valid(ISA_61),
              "front-coded mnemonic source contains a control byte");
static_assert(terminal_mnemonic_max_length(ISA_61) <
                  terminal_front_coding::END,
              "front-coded mnemonic prefix does not fit its marker byte");

static constexpr auto ISA_61_FRONT = terminal_front_coding::encode<
    terminal_front_coding::encoded_size(ISA_61)>(ISA_61);
#endif

class TerminalMnemonicTable {
  public:
    TerminalMnemonicTable(void)
#if MK61_F401_PRODUCT_BUILD
      : scratch_(shared_scratch::Owner::TERMINAL_TRANSFER,
                 sizeof(ISA_61)),
        table_(nullptr) {
      if(!scratch_.ok()) return;
      if(terminal_front_coding::decode(
           ISA_61_FRONT.bytes, sizeof(ISA_61_FRONT.bytes),
           (char*) scratch_.data(), sizeof(ISA_61))) {
        table_ = (const char*) scratch_.data();
      }
    }
#else
      : table_(ISA_61) {}
#endif

    bool ok(void) const { return table_ != nullptr; }
    const char* data(void) const { return table_; }

  private:
#if MK61_F401_PRODUCT_BUILD
    shared_scratch::Lease scratch_;
#endif
    const char* table_;
};

static char* terminal_mnemonic_code(const char* table, u8 opcode,
                                    char* text) {
  if(text == nullptr) return nullptr;
  usize output = 0;
  if(table != nullptr) {
    isize remaining = opcode;
    for(const u8* p = (const u8*) table; *p != 0; p++) {
      if(*p == ',') {
        remaining--;
      } else if(remaining == 0 && output < 8U) {
        text[output++] = (char) *p;
      }
    }
  }
  text[output] = 0;
  return text;
}

#if MK61_DWT_PROFILER_SUPPORTED && MK61_ENABLE_PROFILE_SAVE
class class_terminal::ProfileReportBuilder {
      public:
        ProfileReportBuilder(u8* output, usize capacity)
          : output_(output), capacity_(capacity), length_(0),
            valid_(output != NULL) {}

        void append_text(const char* text) {
          if(!valid_ || text == NULL) {
            valid_ = false;
            return;
          }
          while(*text != 0) append_char(*text++);
        }

        void append_char(char value) {
          if(!valid_ || length_ >= capacity_) {
            valid_ = false;
            return;
          }
          output_[length_++] = (u8) value;
        }

        void append_u64(u64 value) {
          char digits[21];
          usize length = 0;
          do {
            digits[length++] = (char) ('0' + value % 10U);
            value /= 10U;
          } while(value != 0 && length < sizeof(digits));
          while(length != 0) append_char(digits[--length]);
        }

        bool valid(void) const { return valid_; }
        usize length(void) const { return length_; }

      private:
        u8* output_;
        usize capacity_;
        usize length_;
        bool valid_;
    };
#endif

m61_ansi::SavedCursor class_terminal::print_saved_cursor = {};
u8 class_terminal::input_buffer[MAX_INPUT_CHAR] = {};
char  class_terminal::hist_text[HISTORY_TEXT_SIZE] = {};
u16   class_terminal::hist_start[HISTORY_DEPTH] = {};
u8    class_terminal::hist_length[HISTORY_DEPTH] = {};
u8    class_terminal::hist_head = {};
u8    class_terminal::hist_count = {};
u16   class_terminal::hist_used = {};
u16   class_terminal::hist_write = {};
i8    class_terminal::hist_nav = {};
terminal_line_editor::EscapeDecoder class_terminal::escape_decoder = {};
u8    class_terminal::prev_terminator = {};
u8    class_terminal::saved_line[MAX_INPUT_CHAR] = {};
usize class_terminal::saved_len = {};
usize class_terminal::saved_cursor = {};

void class_terminal::history_drop_oldest(void) {
      hist_used -= hist_length[hist_head];
      hist_head = (u8) ((hist_head + 1) % HISTORY_DEPTH);
      hist_count--;
    }

void class_terminal::history_entry_read(u8 slot, u8* out) {
      const u16 start = hist_start[slot];
      for(u8 i = 0; i < hist_length[slot]; i++) out[i] = (u8) hist_text[(u16) ((start + i) % HISTORY_TEXT_SIZE)];
    }

bool class_terminal::history_entry_equals(u8 slot, const u8* line, usize len) {
      if(hist_length[slot] != len) return false;
      const u16 start = hist_start[slot];
      for(usize i = 0; i < len; i++) {
        if((u8) hist_text[(u16) ((start + i) % HISTORY_TEXT_SIZE)] != line[i]) return false;
      }
      return true;
    }

void class_terminal::history_add(const u8* line, usize len) {
      if(len == 0 || len >= HISTORY_TEXT_SIZE) return;
      // подряд идущие одинаковые команды не дублируем
      if(hist_count > 0 && history_entry_equals((u8) ((hist_head + hist_count - 1) % HISTORY_DEPTH), line, len)) return;

      while(hist_count > 0 && (hist_used + len > HISTORY_TEXT_SIZE || hist_count >= HISTORY_DEPTH)) history_drop_oldest();

