bolknote/MK61S_MINI/code/terminal.cpp
void class_terminal::print_power_status(void) {
      const power_monitor::Snapshot power = power_monitor::snapshot();
      const power_monitor::ThresholdRange threshold =
          power_monitor::threshold_range();
      terminal_output::field(Serial, "POWER PVD", power.level);
      terminal_output::field(Serial, " fall=", threshold.falling_min_mv);
      Serial.write('-');
      Serial.print(threshold.falling_max_mv);
      terminal_output::field(Serial, " rise=", threshold.rising_min_mv);
      Serial.write('-');
      Serial.print(threshold.rising_max_mv);
      terminal_output::field(Serial, " state=", power_state_name(power));
      terminal_output::field(Serial, " gate=", power.writes_allowed ? 1 : 0);
      terminal_output::field(Serial, " wait=", power.stable_remaining_ms);
      terminal_output::field(Serial, " event=", power.low_events);
      Serial.write('/');
      Serial.print(power.recovery_events);
      Serial.print(" last=");
      Serial.print(!power.edge_seen ? "none"
          : (power.last_edge_low ? "fall" : "rise"));
      Serial.write('@');
      Serial.print(power.last_edge_ms);
      terminal_output::field(Serial, " prev=", power.previous_unstable ? 1 : 0);
      Serial.write('@');
      Serial.print(power.previous_edge_ms);
      terminal_output::field(Serial, " reject=", power.rejected_programs);
      Serial.write('/');
      Serial.print(power.rejected_erases);
      Serial.write('/');
      Serial.print(power.rejected_msc_writes);
      terminal_output::line(Serial, " reset_flags=0x", crash_dump::boot_reset_flags(), HEX);
    }

#if MK61_ENABLE_ANALOG_REPORT
void class_terminal::print_analog_status(void) {
      const hardware_info::AnalogSnapshot analog =
        hardware_info::read_analog_snapshot();
      char report[144];
      snprintf(report, sizeof(report),
        "ANALOG us/n=%u/%u raw(v/t/b)=%u/%u/%u "
        "val(mV/dC/mV)=%ld/%ld/%ld bat=%s",
        (unsigned) analog.elapsed_us,
        (unsigned) analog.conversion_count,
        (unsigned) analog.raw_vref,
        (unsigned) analog.raw_temperature,
        (unsigned) analog.raw_vbat,
        (long) (analog.vdda.valid ? analog.vdda.millivolts : -1L),
        (long) (analog.mcu_temperature.valid
          ? analog.mcu_temperature.decicelsius : -10000L),
        (long) (analog.battery.voltage.valid
          ? analog.battery.voltage.millivolts : -1L),
        hardware_info::battery_status_name(analog.battery));
      Serial.println(report);
    }

#endif
#if MK61_DWT_PROFILER_SUPPORTED
#if MK61_ENABLE_PROFILE_SAVE
#endif
void class_terminal::print_u64(u64 value) {
      char digits[21];
      usize length = 0;
      do {
        digits[length++] = (char) ('0' + value % 10U);
        value /= 10U;
      } while(value != 0 && length < sizeof(digits));
      while(length != 0) Serial.write(digits[--length]);
    }

void class_terminal::print_profile_statistics(void) {
      terminal_output::field(
          Serial, "PROF state=", dwt_profiler::running() ? "running" : "stopped");
      terminal_output::field(Serial, " clock=", dwt_profiler::clock_hz());
      terminal_output::line(Serial, " overhead=", dwt_profiler::overhead_cycles());

      const classic_scheduler::Snapshot classic =
        classic_timer::statistics();
      terminal_output::field(Serial, "CLASSIC backend=", classic_timer::backend_name());
      terminal_output::field(Serial, " period_us=", classic_timer::configured_period_us());
      terminal_output::field(Serial, " active=", classic.active ? 1 : 0);
      terminal_output::field(Serial, " ticks=", classic.ticks);
      terminal_output::field(Serial, " steps=", classic.steps);
      terminal_output::field(Serial, " missed=", classic.missed_ticks);
      terminal_output::field(Serial, " pending=", classic.pending);
      terminal_output::line(Serial, " max_pending=", classic.maximum_pending);

      #if MK61_ENABLE_SPI1_ARBITER
      const spi1_arbiter::Snapshot spi1 = spi1_bus::statistics();
      terminal_output::field(Serial, "SPI1 backend=", spi1_bus::backend_name());
      terminal_output::field(Serial, " state=", spi1_arbiter::state_name(spi1.state));
      terminal_output::field(Serial, " owner=", spi1_arbiter::owner_name(spi1.owner));
      terminal_output::field(Serial, " acquisitions=", spi1.acquisitions);
      terminal_output::field(Serial, " releases=", spi1.releases);
      terminal_output::field(Serial, " failures=", spi1.failures);
      terminal_output::field(Serial, " contentions=", spi1.contentions);
      terminal_output::field(Serial, " double=", spi1.double_acquires);
      terminal_output::field(Serial, " inactive=", spi1.inactive_releases);
      terminal_output::field(Serial, " wrong=", spi1.wrong_owner_releases);
      terminal_output::field(Serial, " invalid=", spi1.invalid_owners);
      terminal_output::field(Serial, " latched=", spi1.rejected_while_error);
      terminal_output::field(Serial, " recoveries=", spi1.recoveries);
      terminal_output::field(Serial, " last=", spi1_arbiter::result_name(spi1.last_result));
      terminal_output::line(Serial, " fault=", spi1_arbiter::result_name(spi1.last_fault));
      #endif

      #if MK61_ENABLE_SPI1_DMA
      const spi1_dma::Snapshot dma = spi1_dma::statistics();
      terminal_output::field(Serial, "SPI1 DMA backend=", spi1_dma::backend_name());
      terminal_output::field(Serial, " threshold=", dma.threshold);
      terminal_output::field(Serial, " transfers=", dma.transfers);
      terminal_output::field(Serial, " bytes=", dma.bytes);
      terminal_output::field(Serial, " wfi=", dma.wfi_entries);
      terminal_output::field(Serial, " fallback=", dma.polling_fallbacks);
      terminal_output::field(Serial, " init_errors=", dma.initialization_failures);
      terminal_output::field(Serial, " errors=", dma.transfer_failures);
      terminal_output::line(Serial, " timeouts=", dma.timeouts);
      #endif

      const usb_cdc_rx_guard::Snapshot usb_rx =
        usb_cdc_rx_guard::statistics();
      terminal_output::field(Serial, "USB CDC RX backend=", usb_cdc_rx_guard::backend_name());
      terminal_output::field(Serial, " supported=", usb_rx.supported ? 1 : 0);
      terminal_output::field(Serial, " linked=", usb_rx.linked ? 1 : 0);
      terminal_output::line(Serial, " throttles=", usb_rx.throttles);

      const usb_power::Snapshot usb_power_state =
        usb_power::statistics(millis());
      terminal_output::field(Serial, "USB POWER backend=", usb_power::backend_name());
      terminal_output::field(Serial, " supported=", usb_power_state.supported ? 1 : 0);
      terminal_output::field(Serial, " linked=", usb_power_state.wrappers_linked ? 1 : 0);
      terminal_output::field(Serial, " callbacks=", usb_power_state.callbacks_ready ? 1 : 0);
      terminal_output::field(
          Serial, " stop_preserve=", usb_power_state.stop_preservation_enabled ? 1 : 0);
      terminal_output::field(
          Serial, " state=", usb_power_policy::state_name(usb_power_state.state));
      terminal_output::field(Serial, " raw=", usb_power_state.raw_state);
      Serial.write('/');
      Serial.print(usb_power_state.old_state);
      terminal_output::field(
          Serial, " host_remote=", usb_power_state.host_remote_wakeup_enabled ? 1 : 0);
      terminal_output::field(Serial, " endpoints=", usb_power_state.endpoints_idle ? 1 : 0);
      terminal_output::field(Serial, " age_ms=", usb_power_state.suspend_age_ms);
      terminal_output::field(Serial, " hw=", usb_power_state.hardware_suspended ? 1 : 0);
      Serial.write('/');
      Serial.print(usb_power_state.hardware_suspend_events);
      Serial.write('/');
      Serial.print(usb_power_state.recovered_suspend_events);
      terminal_output::field(Serial, " events=", usb_power_state.setup_callbacks);
      Serial.write('/');
      Serial.print(usb_power_state.reset_callbacks);
      Serial.write('/');
      Serial.print(usb_power_state.suspend_callbacks);
      Serial.write('/');
      Serial.print(usb_power_state.resume_callbacks);
      Serial.write('/');
      Serial.print(usb_power_state.connect_callbacks);
      Serial.write('/');
      Serial.print(usb_power_state.disconnect_callbacks);
      terminal_output::field(Serial, " stop=", usb_power_state.stop_arms);
      Serial.write('/');
      Serial.print(usb_power_state.stop_aborts);
      Serial.write('/');
      Serial.print(usb_power_state.host_wakes);
      Serial.write('/');
      Serial.print(usb_power_state.local_wakes);
      terminal_output::field(Serial, " blockers=0x", usb_power_state.last_stop_blockers, HEX);
      terminal_output::line(
          Serial, " epblock=0x", usb_power_state.last_endpoint_blockers, HEX);

      const keyboard_stop_wake_snapshot keyboard_wake =
        kbd::stop_wake_statistics();
      terminal_output::field(Serial, "KBD STOP supported=", keyboard_wake.supported ? 1 : 0);
      terminal_output::field(Serial, " captures=", keyboard_wake.capture_events);
      terminal_output::field(Serial, " last=", keyboard_wake.last_scan_code);
      terminal_output::field(Serial, " count=", keyboard_wake.last_capture_count);
      terminal_output::field(Serial, " wake_rows=0x", keyboard_wake.wake_rows, HEX);
      terminal_output::line(Serial, " captured_rows=0x", keyboard_wake.captured_rows, HEX);
      terminal_output::line(Serial, "KBD overflow=", kbd::overflow_count());

