bolknote/MK61S_MINI/code/terminal.cpp
      const idle_sleep_policy::Snapshot sleep = idle_sleep::statistics();
      terminal_output::field(Serial, "SLEEP backend=", idle_sleep::backend_name());
      terminal_output::field(Serial, " enabled=", idle_sleep::enabled() ? 1 : 0);
      terminal_output::field(Serial, " attempts=", sleep.attempts);
      terminal_output::field(Serial, " entries=", sleep.entries);
      Serial.print(" total_us=");
      print_u64(sleep.total_sleep_us);
      terminal_output::field(Serial, " min_us=", sleep.minimum_sleep_us);
      terminal_output::field(Serial, " avg_us=", sleep.average_sleep_us());
      terminal_output::field(Serial, " max_us=", sleep.maximum_sleep_us);
      terminal_output::line(Serial, " last_blockers=0x", sleep.last_blockers, HEX);
      Serial.print("SLEEP reject");
      for(usize index = 0; index < idle_sleep_policy::BLOCKER_COUNT; index++) {
        Serial.write(' ');
        Serial.print(idle_sleep_policy::blocker_name(index));
        Serial.write('=');
        Serial.print(sleep.rejected[index]);
      }
      Serial.println();

#if MK61_DEEP_IDLE_SUPPORTED
      const deep_idle_policy::Snapshot deep = deep_idle::statistics();
      terminal_output::field(Serial, "DEEP backend=", deep_idle::backend_name());
      terminal_output::field(Serial, " enabled=", deep_idle::enabled() ? 1 : 0);
      terminal_output::field(Serial, " state=", deep_idle_policy::state_name(deep.state));
      terminal_output::field(Serial, " wake=", deep_idle_policy::wake_name(deep.last_wake));
      terminal_output::field(
          Serial, " failure=", deep_idle_policy::failure_name(deep.last_failure));
      terminal_output::field(Serial, " request=", deep.seconds);
      Serial.write('x');
      Serial.print(deep.requested_cycles);
      terminal_output::field(Serial, " completed=", deep.completed_cycles);
      terminal_output::field(Serial, " attempts=", deep.attempts);
      terminal_output::field(Serial, " entries=", deep.entries);
      terminal_output::field(Serial, " wakes=", deep.rtc_timer_wakes);
      Serial.write('/');
      Serial.print(deep.keyboard_wakes);
      Serial.write('/');
      Serial.print(deep.rtc_alarm_wakes);
      Serial.write('/');
      Serial.print(deep.other_wakes);
      terminal_output::field(Serial, " failures=", deep.failures);
      Serial.print(" total_ms=");
      print_u64(deep.total_elapsed_ms);
      terminal_output::field(Serial, " last_ms=", deep.last_elapsed_ms);
      terminal_output::line(Serial, " blockers=0x", deep.last_blockers, HEX);
      Serial.print("DEEP reject");
      for(usize index = 0; index < deep_idle_policy::BLOCKER_COUNT; index++) {
        Serial.write(' ');
        Serial.print(deep_idle_policy::blocker_name(index));
        Serial.write('=');
        Serial.print(deep.rejected[index]);
      }
      Serial.println();
      const deep_idle_auto_policy::Snapshot automatic =
          deep_idle::automatic_statistics(millis());
      terminal_output::field(
          Serial, "DEEP AUTO enabled=", deep_idle::automatic_enabled() ? 1 : 0);
      terminal_output::field(
          Serial, " phase=", deep_idle_auto_policy::phase_name(automatic.phase));
      terminal_output::field(Serial, " holdoff=", automatic.manual_holdoff ? 1 : 0);
      terminal_output::field(Serial, " requests=", automatic.automatic_requests);
      terminal_output::field(Serial, " reentries=", automatic.automatic_reentries);
      terminal_output::line(Serial, " wait_ms=", automatic.wait_remaining_ms);
#endif

      print_power_status();
#if MK61_ENABLE_ANALOG_REPORT
      print_analog_status();
#endif

#if defined(MK61_OLED1602_WS0010)
      print_display_status();
#endif

      for(usize index = 0; index < dwt_profiler::POINT_COUNT; index++) {
        const dwt_profiler::Point point = (dwt_profiler::Point) index;
        const dwt_profiler::Statistics& stats =
          dwt_profiler::statistics(point);
        terminal_output::field(Serial, "PROF ", dwt_profiler::point_name(point));
        terminal_output::field(Serial, " n=", stats.samples);
        terminal_output::field(Serial, " min=", stats.minimum_cycles);
        terminal_output::field(Serial, " avg=", stats.average_cycles());
        terminal_output::field(Serial, " max=", stats.maximum_cycles);
        Serial.print(" total=");
        print_u64(stats.total_cycles);
        Serial.println();
      }
    }

#if MK61_ENABLE_PROFILE_SAVE
u16 class_terminal::build_profile_report(u8* output, usize capacity) {
      ProfileReportBuilder report(output, capacity);
      report.append_text("MK61 DWT PROFILE 2\nstate=");
      report.append_text(dwt_profiler::running() ? "running" : "stopped");
      report.append_text(",clock=");
      report.append_u64(dwt_profiler::clock_hz());
      report.append_text(",overhead=");
      report.append_u64(dwt_profiler::overhead_cycles());
      const classic_scheduler::Snapshot classic =
        classic_timer::statistics();
      report.append_text("\nclassic_backend=");
      report.append_text(classic_timer::backend_name());
      report.append_text(",period_us=");
      report.append_u64(classic_timer::configured_period_us());
      report.append_text(",active=");
      report.append_u64(classic.active ? 1 : 0);
      report.append_text(",ticks=");
      report.append_u64(classic.ticks);
      report.append_text(",steps=");
      report.append_u64(classic.steps);
      report.append_text(",missed=");
      report.append_u64(classic.missed_ticks);
      report.append_text(",pending=");
      report.append_u64(classic.pending);
      report.append_text(",max_pending=");
      report.append_u64(classic.maximum_pending);
      #if MK61_ENABLE_SPI1_DMA
      const spi1_dma::Snapshot dma = spi1_dma::statistics();
      report.append_text("\nspi1_dma_backend=");
      report.append_text(spi1_dma::backend_name());
      report.append_text(",threshold=");
      report.append_u64(dma.threshold);
      report.append_text(",transfers=");
      report.append_u64(dma.transfers);
      report.append_text(",bytes=");
      report.append_u64(dma.bytes);
      report.append_text(",wfi=");
      report.append_u64(dma.wfi_entries);
      report.append_text(",fallback=");
      report.append_u64(dma.polling_fallbacks);
      report.append_text(",init_errors=");
      report.append_u64(dma.initialization_failures);
      report.append_text(",errors=");
      report.append_u64(dma.transfer_failures);
      report.append_text(",timeouts=");
      report.append_u64(dma.timeouts);
      #endif
      const usb_cdc_rx_guard::Snapshot usb_rx =
        usb_cdc_rx_guard::statistics();
      report.append_text("\nusb_cdc_rx_backend=");
      report.append_text(usb_cdc_rx_guard::backend_name());
      report.append_text(",supported=");
      report.append_u64(usb_rx.supported ? 1 : 0);
      report.append_text(",linked=");
      report.append_u64(usb_rx.linked ? 1 : 0);
      report.append_text(",throttles=");
      report.append_u64(usb_rx.throttles);
      const usb_power::Snapshot usb_power_state =
        usb_power::statistics(millis());
      report.append_text("\nusb_power_backend=");
      report.append_text(usb_power::backend_name());
      report.append_text(",supported=");
      report.append_u64(usb_power_state.supported ? 1 : 0);
      report.append_text(",linked=");
      report.append_u64(usb_power_state.wrappers_linked ? 1 : 0);
      report.append_text(",callbacks=");
      report.append_u64(usb_power_state.callbacks_ready ? 1 : 0);
      report.append_text(",stop_preserve=");
      report.append_u64(
          usb_power_state.stop_preservation_enabled ? 1 : 0);
      report.append_text(",state=");
      report.append_text(usb_power_policy::state_name(usb_power_state.state));
      report.append_text(",raw=");
      report.append_u64(usb_power_state.raw_state);
      report.append_char('/');
      report.append_u64(usb_power_state.old_state);
      report.append_text(",host_remote=");
      report.append_u64(
          usb_power_state.host_remote_wakeup_enabled ? 1 : 0);
      report.append_text(",endpoints=");
      report.append_u64(usb_power_state.endpoints_idle ? 1 : 0);
      report.append_text(",age_ms=");
      report.append_u64(usb_power_state.suspend_age_ms);
      report.append_text(",hardware_suspended=");
      report.append_u64(usb_power_state.hardware_suspended ? 1 : 0);
      report.append_text(",hardware_suspend_events=");
      report.append_u64(usb_power_state.hardware_suspend_events);
      report.append_text(",recovered_suspend_events=");
      report.append_u64(usb_power_state.recovered_suspend_events);
      report.append_text(",setup=");
      report.append_u64(usb_power_state.setup_callbacks);
      report.append_text(",reset=");
      report.append_u64(usb_power_state.reset_callbacks);
      report.append_text(",suspend=");
      report.append_u64(usb_power_state.suspend_callbacks);
      report.append_text(",resume=");
      report.append_u64(usb_power_state.resume_callbacks);
      report.append_text(",connect=");
      report.append_u64(usb_power_state.connect_callbacks);
      report.append_text(",disconnect=");
      report.append_u64(usb_power_state.disconnect_callbacks);
      report.append_text(",stop_arms=");
      report.append_u64(usb_power_state.stop_arms);
      report.append_text(",stop_aborts=");
      report.append_u64(usb_power_state.stop_aborts);
      report.append_text(",host_wakes=");
      report.append_u64(usb_power_state.host_wakes);
      report.append_text(",local_wakes=");
      report.append_u64(usb_power_state.local_wakes);
      report.append_text(",stop_blockers=");
      report.append_u64(usb_power_state.last_stop_blockers);
      report.append_text(",endpoint_blockers=");
      report.append_u64(usb_power_state.last_endpoint_blockers);
      const idle_sleep_policy::Snapshot sleep = idle_sleep::statistics();
      report.append_text("\nsleep_backend=");
      report.append_text(idle_sleep::backend_name());
      report.append_text(",enabled=");
      report.append_u64(idle_sleep::enabled() ? 1 : 0);
      report.append_text(",attempts=");
      report.append_u64(sleep.attempts);
      report.append_text(",entries=");
      report.append_u64(sleep.entries);
      report.append_text(",total_us=");
      report.append_u64(sleep.total_sleep_us);
      report.append_text(",min_us=");
      report.append_u64(sleep.minimum_sleep_us);
      report.append_text(",avg_us=");
      report.append_u64(sleep.average_sleep_us());
      report.append_text(",max_us=");
      report.append_u64(sleep.maximum_sleep_us);
      report.append_text(",last_blockers=");
      report.append_u64(sleep.last_blockers);
      report.append_text("\nsleep_reject,name,count\n");
      for(usize index = 0; index < idle_sleep_policy::BLOCKER_COUNT; index++) {
        report.append_text("sleep_reject,");
        report.append_text(idle_sleep_policy::blocker_name(index));
        report.append_char(',');
        report.append_u64(sleep.rejected[index]);
        report.append_char('\n');
      }

#if MK61_DEEP_IDLE_SUPPORTED
      const deep_idle_policy::Snapshot deep = deep_idle::statistics();
      report.append_text("deep_backend=");
      report.append_text(deep_idle::backend_name());
      report.append_text(",enabled=");
      report.append_u64(deep_idle::enabled() ? 1 : 0);
      report.append_text(",state=");
      report.append_text(deep_idle_policy::state_name(deep.state));
      report.append_text(",wake=");
      report.append_text(deep_idle_policy::wake_name(deep.last_wake));
      report.append_text(",failure=");
      report.append_text(deep_idle_policy::failure_name(deep.last_failure));
      report.append_text(",seconds=");
      report.append_u64(deep.seconds);
      report.append_text(",requested=");
      report.append_u64(deep.requested_cycles);
      report.append_text(",completed=");
      report.append_u64(deep.completed_cycles);
      report.append_text(",entries=");
      report.append_u64(deep.entries);
      report.append_text(",rtc=");
      report.append_u64(deep.rtc_timer_wakes);
      report.append_text(",keyboard=");
      report.append_u64(deep.keyboard_wakes);
      report.append_text(",alarm=");
      report.append_u64(deep.rtc_alarm_wakes);
      report.append_text(",other=");
      report.append_u64(deep.other_wakes);
      report.append_text(",failures=");
      report.append_u64(deep.failures);
      report.append_text(",total_ms=");
      report.append_u64(deep.total_elapsed_ms);
      report.append_text(",last_ms=");
      report.append_u64(deep.last_elapsed_ms);
      report.append_text(",blockers=");
      report.append_u64(deep.last_blockers);
      report.append_char('\n');
#endif
#if defined(MK61_OLED1602_WS0010)
      report.append_text("display_controller=WS0010,ft=10,wait=busy+floor");
      report.append_text(",bf_seen=");
      report.append_u64(main_lcd().busyFlagObserved() ? 1 : 0);
      report.append_text(",bf_timeouts=");
      report.append_u64(main_lcd().busyFlagTimeouts());
      report.append_text(",bf_fault=");
      report.append_u64(main_lcd().busyFlagFaulted() ? 1 : 0);
      report.append_text(",graphics=");
      if(!main_lcd().supportsWs0010Graphics()) {
        report.append_text("disabled");
      } else {
#if MK61_WS0010_GRAPHICS_PROFILE_QUALIFIED
        report.append_text("qualified,gdram=100x16,visible=80x16");
#else
        report.append_text("laboratory,gdram=100x16,visible=80x16");
#endif
      }
      report.append_text(",brightness=software-unsupported,mode=");
      report.append_text(main_lcd().graphicsMode()
                         ? "graphics" : "character");
      report.append_text(",state=");
      report.append_text(main_lcd().displayEnabled() ? "on" : "off");
      report.append_text(",route=");
      report.append_text(main_lcd().usbScreenActive()
                         ? "usb-screen" : "oled");
      report.append_text(",sleep=");
      report.append_text(oled_protection::timeoutName(
        main_lcd().oledProtectionTimeout()));
      report.append_text(",init=");
      report.append_text(ws0010::initializationPhaseName(
        main_lcd().initializationPhase()));
      report.append_text(",reinit=");
      report.append_u64(main_lcd().reinitializationCount());
      report.append_char('\n');
#endif
      report.append_text("\npoint,samples,min,avg,max,total\n");

