bolknote/MK61S_MINI/code/terminal.cpp
bool class_terminal::GetHexString(const char* args) {
      args = terminal_core::skip_spaces(args);
      if(args == NULL) return false;

      usize address = 0;
      for(usize i = 0; i < 4; i++) {
        if(args[i] < '0' || args[i] > '9') {
          Serial.println("Address must contain exactly four decimal digits.");
          return false;
        }
        address = address * 10 + (usize) (args[i] - '0');
      }
      if(!terminal_core::is_space(args[4]) || address >= core_61::MAX_PROGRAM_STEP) {
        Serial.println("BAD address!");
        return false;
      }

      const char* hex = terminal_core::skip_spaces(args + 4);
      if(hex == NULL || terminal_core::is_end(*hex)) {
        Serial.println("Hex byte string is empty.");
        return false;
      }

      u8 code_page[core_61::CODE_PAGE_BUFFER_SIZE] = {};
      core_61::get_code_page(&code_page[0]);
      usize write_at = address;
      while(!terminal_core::is_end(*hex) && !terminal_core::is_space(*hex)) {
        const int high = terminal_core::digit_value(hex[0], 16);
        const int low = terminal_core::digit_value(hex[1], 16);
        if(high < 0 || low < 0) {
          Serial.println("Hex byte string must contain complete byte pairs.");
          return false;
        }
        if(write_at >= core_61::MAX_PROGRAM_STEP) {
          Serial.println("Program memory overflow!");
          return false;
        }
        code_page[write_at++] = (u8) ((high << 4) | low);
        hex += 2;
      }
      if(!terminal_core::at_end(hex)) {
        Serial.println("Unexpected text after hex byte string.");
        return false;
      }

      const bool force_expanded = write_at > core_61::CLASSIC_PROGRAM_STEP;
      apply_program_memory_auto(&code_page[0], core_61::MAX_PROGRAM_STEP, false, force_expanded);
      core_61::set_code_page(&code_page[0]);
      return true;
    }

void  class_terminal::PutHexString(void) {
      u8 code_page[core_61::CODE_PAGE_BUFFER_SIZE] = {};
      core_61::get_code_page(&code_page[0]);
      isize last_cmd_addr = seek_program_END(&code_page[0]);
      dbgln(MINI, "Last step in programm: ", last_cmd_addr);
      isize j = 0;
      while (j < last_cmd_addr) {
        Serial.print("00"); print_address_as_MK61(j); Serial.write(' ');
        isize jk = 0;
        while (jk < 24) {
          Serial_write_hex(code_page[j]);
          j++; jk++;
          if (j >= last_cmd_addr) break;
        }
        Serial.println();
      }
    }

bool class_terminal::Assembler(void) {
      TerminalMnemonicTable table;
      if(!table.ok()) {
        Serial.println("Mnemonic workspace busy");
        return false;
      }
      const terminal_core::Assembly assembly = terminal_core::parse_assembly(
        command_args(), AT, table.data(), core_61::MAX_PROGRAM_STEP);
      if(assembly.error != terminal_core::AssemblyError::NONE) {
        ErrorReaction();
        switch(assembly.error) {
          case terminal_core::AssemblyError::EMPTY: Serial.println("Usage: asm [addr] <mnemonics>"); break;
          case terminal_core::AssemblyError::BAD_ADDRESS: Serial.println("BAD address!"); break;
          case terminal_core::AssemblyError::TOO_LONG: Serial.println("Program memory overflow!"); break;
          case terminal_core::AssemblyError::UNKNOWN_MNEMONIC:
            Serial.print("Unexpected token: ");
            Serial.println(assembly.error_at == NULL ? "" : assembly.error_at);
            break;
          case terminal_core::AssemblyError::NONE: break;
        }
        return false;
      }

      // Сначала полностью разбираем, затем применяем один раз: ошибочный токен
      // должен оставить программу без изменений.
      u8 code_page[core_61::CODE_PAGE_BUFFER_SIZE] = {};
      core_61::get_code_page(&code_page[0]);
      for(usize i = 0; i < assembly.count; i++) code_page[assembly.address + i] = assembly.opcodes[i];
      apply_program_memory_auto(&code_page[0], core_61::MAX_PROGRAM_STEP, false);
      core_61::set_code_page(&code_page[0]);
      AT = (isize) (assembly.address + assembly.count);

      Serial.print("Assembled ");
      Serial.print(assembly.count);
      Serial.print(" opcode(s) at ");
      Serial.println(assembly.address);
      return true;
    }

terminal_protocol::Result class_terminal::command_to_kbd(bool script_mode) {
      usize code_61 = 0;
      const usize command_count = terminal_keys::COUNT;
      if(!terminal_core::parse_single_unsigned(command_args(), 16, command_count - 1, code_61)) {
        Serial.println("Usage: cmd <00..EF>");
        return terminal_protocol::Result::error();
      }

      u32 sequence = terminal_keys::sequence((u8) code_61);
      dbgln(MK61E, "mk61 <- ", (u8) code_61);
      dbghexln(MK61E, "mk61 <- $", (i32) sequence);

      for(isize i=0; i<4; i++) {
        const i8 scan_code = sequence & 0xFF;
        if(scan_code < 0) break;

        // Скрипт адресует ядро, а не текущий foreground (это может быть меню).
        if(script_mode) hidden_press_key((sw) scan_code);
        else kbd::push(scan_code);
        sequence >>= 8;
      }
      return terminal_protocol::Result::ok();
    }

bool class_terminal::scancode_to_kbd(i32& out) {
      usize key_code = 0;
      if(!terminal_core::parse_single_unsigned(command_args(), 16, 0x27, key_code)) {
        Serial.println("Usage: kbd <00..27>");
        return false;
      }
      dbghexln(MK61E, "mk61 <- ", key_code, "H");
      out = (i32) key_code;
      return true;
    }

bool class_terminal::value_fits_mk61(double value) {
      char sign = ' ';
      char mantissa[8];
      isize pow10 = 0;
      return mk61_ref::double_to_parts(value, sign, mantissa, pow10);
    }

bool class_terminal::write_register_value(u8 reg, const char* args) {
      const mk61_ref::Ref ref = {mk61_ref::Kind::R, reg};
      mk61_register_init::Value value = {};
      if(!mk61_register_init::parse(args, value)) return false;
      // Сначала проверяем сам адрес. В частности, недоступный RF не должен
      // расходовать очередное значение независимого потока M61_INIT.
      if(!mk61_ref::register_available(reg)) return false;

      switch(value.kind) {
        case mk61_register_init::Kind::NUMBER:
          return value_fits_mk61(value.number) &&
                 mk61_ref::write(ref, value.number);
        case mk61_register_init::Kind::RANDOM: {
          // Этот путь намеренно не проверяет random_seed_enabled(): настройка
          // управляет только ROM-командой К СЧ, а инициализатор M61 имеет свой
          // независимый поток аппаратно собранной энтропии.
          const u32 seed7 = entropy_pool::next_decimal7(
              entropy_pool::Domain::M61_INIT);
          return mk61_ref::write_fraction7(ref, seed7);
        }
        case mk61_register_init::Kind::RAW:
          return mk61_ref::write_raw_register(reg, value.raw);
      }
      return false;
    }

bool class_terminal::write_stack_value(const char* args) {
      args = terminal_core::skip_spaces(args);
      if(args == NULL || args[0] == 0 || !terminal_core::is_space(args[1])) return false;

