bolknote/MK61S_MINI/code/terminal.cpp
                  if(count < 100) Serial.write('0');
                  if(count < 10) Serial.write('0');
                  Serial.print(count); Serial.write(' ');
                }
                Serial.write((char) (ring_cell < 10)? ring_cell + '0' : ring_cell - 10 + 'A');
                count++;
                i--;
              }
            }
            Serial.println();
            break;
          case  CMD_LASM:
              lasm_mk61_code_page();
            break;
          case  CMD_INS: {
              const char* args = command_args();
              usize into_step = 0;
              usize opcode = 0;
              if(!terminal_core::parse_unsigned(args, 10, core_61::program_steps() - 1, into_step) ||
                 !terminal_core::parse_unsigned(args, 16, 0xFF, opcode) ||
                 !terminal_core::at_end(args)) {
                Serial.println("Usage: ins <step> <00..FF>");
                recive_pos = 0;
                return terminal_protocol::Result::error();
              }
              insert_cmd_in_program(into_step, opcode);
            break;
          }
          case  CMD_STACK:
              echo_mk61_stack();
            break;
          case  CMD_HOUT:
              PutHexString();
            break;
          case  CMD_VFAT_LOG: {
              if(!terminal_vfat_log(command_args())) {
                recive_pos = 0;
                return terminal_protocol::Result::error();
              }
            }
            break;
          case CMD_FS_PWD: {
              if(!terminal_core::at_end(command_args())) {
                Serial.println("Usage: pwd");
                recive_pos = 0;
                return terminal_protocol::Result::error();
              }
              char path[MAX_INPUT_CHAR];
              const storage_path::Status status = storage_path::format_directory(
                  current_directory, path, sizeof(path));
              if(status != storage_path::Status::OK) {
                terminal_path_error("pwd", status);
                recive_pos = 0;
                return terminal_protocol::Result::error();
              }
              terminal_println_m8(path);
            }
            break;
          case CMD_FS_CD: {
              const char* args = command_args();
              u16 directory = program_store::ROOT_ID;
              storage_path::Status status = storage_path::Status::OK;
              if(!terminal_core::at_end(args)) {
                status = storage_path::resolve_directory(current_directory,
                                                         args, directory);
              }
              if(status != storage_path::Status::OK) {
                terminal_path_error("cd", status);
                recive_pos = 0;
                return terminal_protocol::Result::error();
              }
              current_directory = directory;
            }
            break;
          case CMD_FS_LIST: {
              const char* args = command_args();
              u16 directory = current_directory;
              if(!terminal_core::at_end(args)) {
                storage_path::Status status = storage_path::resolve_directory(
                    current_directory, args, directory);
                if(status != storage_path::Status::OK) {
                  program_store::Entry single;
                  status = storage_path::resolve_entry(current_directory,
                                                       args, single);
                  if(status == storage_path::Status::OK) {
                    terminal_print_fs_entry(single);
                    break;
                  }
                  terminal_path_error("ls", status);
                  recive_pos = 0;
                  return terminal_protocol::Result::error();
                }
              }
              const int stored_count = program_store::child_count(directory);
              for(int index = 0; index < stored_count; index++) {
                program_store::Entry entry;
                if(!program_store::child(directory, index, entry)) {
                  Serial.println("ls: storage error");
                  recive_pos = 0;
                  return terminal_protocol::Result::error();
                }
                terminal_print_fs_entry(entry);
              }
              Serial.print(stored_count);
              Serial.println(stored_count == 1 ? " entry." : " entries.");
            }
            break;
          case CMD_FS_MKDIR: {
              const char* cursor = command_args();
              char path[MAX_INPUT_CHAR];
              if(!terminal_core::parse_token(cursor, path, sizeof(path))) {
                Serial.println("Usage: mkdir [-p] <path>");
                recive_pos = 0;
                return terminal_protocol::Result::error();
              }
              bool parents = false;
              if(strcmp(path, "-p") == 0) {
                parents = true;
                if(!terminal_core::parse_token(cursor, path, sizeof(path))) {
                  Serial.println("Usage: mkdir [-p] <path>");
                  recive_pos = 0;
                  return terminal_protocol::Result::error();
                }
              }
              if(!terminal_core::at_end(cursor)) {
                Serial.println("Usage: mkdir [-p] <path>");
                recive_pos = 0;
                return terminal_protocol::Result::error();
              }
              u16 created = program_store::INVALID_ID;
              const storage_path::Status status = storage_path::create_directory(
                  current_directory, path, parents, created);
              if(status != storage_path::Status::OK) {
                terminal_path_error("mkdir", status);
                recive_pos = 0;
                return terminal_protocol::Result::error();
              }
            }
            break;
          case CMD_FS_MOVE: {
              const char* cursor = command_args();
              char path[MAX_INPUT_CHAR];
              if(!terminal_core::parse_token(cursor, path, sizeof(path))) {
                Serial.println("Usage: mv <source> <destination>");
                recive_pos = 0;
                return terminal_protocol::Result::error();
              }
              program_store::Entry source;
              storage_path::Status status = storage_path::resolve_entry(
                  current_directory, path, source);
              if(status != storage_path::Status::OK ||
                 !terminal_core::parse_token(cursor, path, sizeof(path)) ||
                 !terminal_core::at_end(cursor)) {
                if(status != storage_path::Status::OK) {
                  terminal_path_error("mv", status);
                } else {
                  Serial.println("Usage: mv <source> <destination>");
                }
                recive_pos = 0;
                return terminal_protocol::Result::error();
              }
              u16 parent = program_store::INVALID_ID;
              char name[program_store::NAME_SIZE];
              status = storage_path::move_target(current_directory, source,
                                                 path, parent, name,
                                                 sizeof(name));
              if(status != storage_path::Status::OK ||
                 !program_store::move_rename(source.id, parent, name)) {
                terminal_path_error("mv", status == storage_path::Status::OK
                    ? storage_path::Status::IO_ERROR : status);
                recive_pos = 0;
                return terminal_protocol::Result::error();
              }
            }
            break;
          case CMD_FS_REMOVE: {
              const char* cursor = command_args();
              char path[MAX_INPUT_CHAR];
              if(!terminal_core::parse_token(cursor, path, sizeof(path))) {
                Serial.println("Usage: rm [-r] <path>");
                recive_pos = 0;
                return terminal_protocol::Result::error();
              }
              bool recursive = false;
              if(strcmp(path, "-r") == 0 || strcmp(path, "-R") == 0) {
                recursive = true;
                if(!terminal_core::parse_token(cursor, path, sizeof(path))) {
                  Serial.println("Usage: rm [-r] <path>");
                  recive_pos = 0;
                  return terminal_protocol::Result::error();
                }
              }
              if(!terminal_core::at_end(cursor)) {
                Serial.println("Usage: rm [-r] <path>");
                recive_pos = 0;
                return terminal_protocol::Result::error();
              }
              program_store::Entry entry;
              const storage_path::Status status = storage_path::resolve_entry(
                  current_directory, path, entry);
              if(status != storage_path::Status::OK) {
                terminal_path_error("rm", status);
                recive_pos = 0;
                return terminal_protocol::Result::error();
              }
              if(entry.kind == program_store::NodeKind::DIRECTORY &&
                 !recursive) {
                Serial.println("rm: is a directory; use rm -r or rmdir");
                recive_pos = 0;
                return terminal_protocol::Result::error();
              }
              u16 removed = 0;
              if(!program_store::remove_tree(entry.id, &removed)) {
                Serial.println("rm: storage error");
                recive_pos = 0;
                return terminal_protocol::Result::error();
              }
              Serial.print("Removed ");
              Serial.print(removed);
              Serial.println(removed == 1 ? " entry." : " entries.");
            }
            break;
          case CMD_FS_RMDIR: {
              char path[MAX_INPUT_CHAR];
              if(!terminal_single_token(command_args(), path, sizeof(path))) {
                Serial.println("Usage: rmdir <path>");
                recive_pos = 0;
                return terminal_protocol::Result::error();
              }
              u16 directory = program_store::ROOT_ID;
              storage_path::Status status = storage_path::resolve_directory(
                  current_directory, path, directory);
              if(status != storage_path::Status::OK ||
                 directory == program_store::ROOT_ID) {
                terminal_path_error("rmdir",
                    directory == program_store::ROOT_ID &&
                    status == storage_path::Status::OK
                        ? storage_path::Status::ROOT : status);
                recive_pos = 0;
                return terminal_protocol::Result::error();
              }
              if(program_store::child_count(directory) != 0 ||
                 !program_store::remove_id(directory)) {
                Serial.println("rmdir: directory not empty or storage error");
                recive_pos = 0;
                return terminal_protocol::Result::error();
              }
            }
            break;
          case CMD_FS_STAT: {
              if(!terminal_core::at_end(command_args())) {
                Serial.println("Usage: df");
                recive_pos = 0;
                return terminal_protocol::Result::error();
              }
              if(!program_store::ready()) {
                if(program_store::mount_status() ==
                   program_store::MountStatus::FORMAT_REQUIRED) {
                  Serial.println("C5: legacy volume; run format to create C6");
                  Serial.println("Files were not modified");
                } else if(program_store::mount_status() ==
                          program_store::MountStatus::REPAIR_REQUIRED) {
                  Serial.println("C6: catalog damaged; run format or use Erase FLASH menu");
                  Serial.println("Files were not modified");
                } else {
                  Serial.println("C6: unavailable");
                }
                break;
              }
              u16 directories = 0;
              const int stored_visible = program_store::total_count();
              for(int index = 0; index < stored_visible; index++) {
                program_store::Entry entry;
                if(program_store::entry_at(index, entry) &&
                   entry.kind == program_store::NodeKind::DIRECTORY) {
                  directories++;
                }
              }
              const u16 used = program_store::used_nodes();
              const u16 maximum = program_store::max_nodes();
              terminal_output::field(
                  Serial, "Flash: ", program_store::geometry().capacity_bytes);
              Serial.println(" bytes");
              Serial.print("Nodes: "); Serial.print(used); Serial.print(" used, ");
              Serial.print(maximum - used); Serial.print(" free, ");
              Serial.print(maximum); Serial.println(" total");
              terminal_output::field(Serial, "Visible: ", stored_visible - directories);
              Serial.print(" files, "); Serial.print(directories);
              terminal_output::field(Serial, " directories, ", used - stored_visible);
              Serial.println(" hidden extents");
              terminal_output::field(
                  Serial, "FAT12 cluster: ", (u32) program_store::geometry().sectors_per_cluster * 512U);
              Serial.println(" bytes (virtual)");
              Serial.print("Settings: "); Serial.print(program_store::settings_size());
              Serial.println(" bytes reserved");
              SpiNorFlash::Diagnostics flash = {};
              if(external_flash().diagnostics(flash)) {
                Serial.print("NOR JEDEC=0x");
                terminal_print_hex_byte((u8) (flash.jedec_id >> 16));
                terminal_print_hex_byte((u8) (flash.jedec_id >> 8));
                terminal_print_hex_byte((u8) flash.jedec_id);
                terminal_output::field(Serial, " SFDP=", flash.sfdp_present ? 1 : 0);
                terminal_output::field(Serial, " probe=", flash.probe_upper_bytes);
                terminal_output::field(Serial, " page=", flash.page_size);
                Serial.print(" erase=0x");
                terminal_print_hex_byte(flash.erase_opcode);
                terminal_output::field(
                    Serial, " address-bytes=", flash.four_byte_address ? 4 : 3);
                terminal_output::field(
                    Serial, " opcodes=", flash.four_byte_opcodes ? "4-byte" : "legacy");
                Serial.print(" status=");
                for(u8 index = 0; index < flash.status_count; index++) {
                  if(index != 0) Serial.write('/');
                  terminal_print_hex_byte(flash.status[index]);
                }
                Serial.println();
                terminal_output::field(
                    Serial, "SPI1 requested_hz=", flash.requested_clock_hz);
                terminal_output::field(Serial, " pclk_hz=", flash.peripheral_clock_hz);
                terminal_output::field(Serial, " prescaler=", flash.prescaler);
                terminal_output::line(Serial, " actual_hz=", flash.actual_clock_hz);
              } else {
                Serial.println("NOR diagnostics=unavailable");
              }
              print_power_status();
#if MK61_ENABLE_ANALOG_REPORT
              print_analog_status();
#endif
              const resident_firmware::Result firmware =
                  resident_firmware::verify();
              Serial.print("FIRMWARE CRC state=");
              Serial.print(resident_firmware_format::status_name(
                  firmware.status));
              terminal_output::field(Serial, " required=", MK61_REQUIRE_RESIDENT_CRC);
              terminal_output::field(Serial, " image=", firmware.image_size);
              terminal_output::field(Serial, " footer=", firmware.footer_offset);
              Serial.print(" expected=0x");
              terminal_print_hex_u32(firmware.expected_crc32);
              Serial.print(" build=0x");
              terminal_print_hex_u32(resident_firmware::build_id());
              Serial.print(" actual=0x");
              terminal_print_hex_u32(firmware.actual_crc32);
              Serial.print(" backend=");
              Serial.print(firmware.status ==
                               resident_firmware_format::Status::VALID
                           ? (firmware.hardware_crc ? "hardware" : "software")
                           : "not-run");
              terminal_output::line(Serial, " cycles=", firmware.cycles);
              resident_firmware::Failure firmware_failure = {};
              if(resident_firmware::last_failure(firmware_failure)) {
                Serial.print("FIRMWARE last-failure state=");
                Serial.print(resident_firmware_format::status_name(
                    firmware_failure.status));
                Serial.print(" build=0x");
                terminal_print_hex_u32(firmware_failure.build_id);
                Serial.print(" expected=0x");
                terminal_print_hex_u32(firmware_failure.expected_crc32);
                Serial.print(" actual=0x");
                terminal_print_hex_u32(firmware_failure.actual_crc32);
                Serial.println();
              }
            }
            break;
          case CMD_FS_GET: {
              const terminal_protocol::Result result = exec_fs_get();
              recive_pos = 0;
              return result;
            }
          case CMD_FS_PUT: {
              const terminal_protocol::Result result = exec_fs_put();
              recive_pos = 0;
              return result;
            }
          case  CMD_FS_CLEAN: {
              const u16 purged = program_store::purge_empty();
              Serial.print("Removed ");
              Serial.print(purged);
              Serial.println(" empty entries.");
            }
            break;
          case  CMD_RUN: {
              // "run <имя>" — синоним open; без имени — запуск программы МК61.
              const char* args = command_args();
              if(*args == ':') { // run :метка - переход внутри m61-скрипта
                if(script_mode) return script_action(terminal_protocol::ResultKind::GOTO_LABEL, args + 1);
                Serial.println("Labels work in m61 scripts only!");
                recive_pos = 0;
                return terminal_protocol::Result::error();
              }
              if(trap_mode) {
                Serial.println("Only run :label is allowed in an M61 trap handler!");
                recive_pos = 0;
                return terminal_protocol::Result::error();
              }
              if(*args != 0) {
                if(script_mode) return script_action(terminal_protocol::ResultKind::OPEN_FILE, args);
                if(!OpenStoredFile(current_directory, args)) {
                  Serial.println("Open failed!");
                  recive_pos = 0;
                  return terminal_protocol::Result::error();
                }
                break;
              }
              if(script_mode) return script_action(terminal_protocol::ResultKind::RUN_PROGRAM, "");
              kbd::push((i8) sw::F);   // F
              kbd::push((i8) sw::NEG); // /-/
              kbd::push((i8) sw::RET); // В/О
              kbd::push((i8) sw::RUN); // C/П
            }
            break;
          case CMD_OPEN: {
              const char* args = command_args();
              if(terminal_core::at_end(args)) {
                Serial.println("Usage: open <path>");
                recive_pos = 0;
                return terminal_protocol::Result::error();
              }
              if(script_mode) return script_action(terminal_protocol::ResultKind::OPEN_FILE, args);
              if(!OpenStoredFile(current_directory, args)) {
                Serial.println("Open failed!");
                recive_pos = 0;
                return terminal_protocol::Result::error();
              }
            }
            break;
          case  CMD_POKE:
              if(!write_stack_value(command_args())) {
                Serial.println("Usage: poke <X|Y|Z|T> <finite number with exponent -99..99>");
                recive_pos = 0;
                return terminal_protocol::Result::error();
              }
            break;
          case  CMD_HIN:
          case  CMD_SET_CODE:
              if(!GetHexString(command_id == CMD_SET_CODE ? (const char*) &input_buffer[4] : command_args())) {
                recive_pos = 0;
                return terminal_protocol::Result::error();
              }
            break;
          case  CMD_ASM:
              if(!Assembler()) {
                recive_pos = 0;
                return terminal_protocol::Result::error();
              }
            break;
          case  CMD_HELP:
              print_help();
            break;
          case  CMD_LED:
              if(!exec_led()) {
                Serial.println("Usage: led <0|1>[,<ms>,<0|1>,...]");
                recive_pos = 0;
                return terminal_protocol::Result::error();
              }
            break;
          case  CMD_BEEP:
              if(!exec_beep()) {
                Serial.println("Usage: beep <Hz>,<ms>[,<Hz>,<ms>,...]");
                recive_pos = 0;
                return terminal_protocol::Result::error();
              }
            break;
          case  CMD_IF:
              return exec_if(script_mode, trap_mode);
          case CMD_PRINT:
              if(!exec_print(script_mode)) {
                recive_pos = 0;
                return terminal_protocol::Result::error();
              }
            break;
          case CMD_WAIT: {
              usize milliseconds = 0;
              if(!script_mode ||
                 !terminal_core::parse_single_unsigned(
                     command_args(), 10, 60000, milliseconds) ||
                 milliseconds == 0) {
                Serial.println("Usage in M61: wait <1..60000>");
                recive_pos = 0;
                return terminal_protocol::Result::error();
              }
              recive_pos = 0;
              return terminal_protocol::Result::wait((i32) milliseconds);
            }
          case CMD_RET:
              if(!terminal_core::at_end(command_args())) {
                Serial.println("Usage: ret");
                recive_pos = 0;
                return terminal_protocol::Result::error();
              }
              if(script_mode) {
                return script_action(
                    terminal_protocol::ResultKind::RETURN_SCRIPT, "");
              }
              Serial.println("ret works in M61 scripts only!");
              recive_pos = 0;
              return terminal_protocol::Result::error();
          case  CMD_HISTORY:
              history_print();
            break;
          default:
              if(input_buffer[0] != 0) {
                Serial.print("Unknown command: ");
                terminal_println_m8((const char*) input_buffer);
              }
              recive_pos = 0;
              return terminal_protocol::Result::error();
        }

